<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"75a194299b8e2f04400c446c14c453722a0fca4116c57ada042cbe8187110014","plan_job_ref":"Job Create MPE Management terraform plan #41 at https://github.com/AFMPE/mpe_management/actions/runs/4810957588","plan_hash":"23f30889959c3d2a2de7d6817a69dd8c289a08cc0e6db5a16727b73989afba14","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __src__
With backend config: `storage_account_name=afmpetfmgtprodh8dc4qua
container_name=core-mgt-prod-tfstate            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `src/tfvars/production/parameters.prod.tfvars
`<details open><summary>With variables</summary>

```hcl
state_sa_container_name           = (sensitive value)
state_sa_name                     = (sensitive value)
state_sa_rg                       = (sensitive value)
subscription_id_hub               = (sensitive value)
subscription_id_internal          = (sensitive value)
subscription_id_partners_gsa_dev  = (sensitive value)
subscription_id_partners_gsa_prod = (sensitive value)
subscription_id_sandbox           = (sensitive value)
```
</details>
<details>
<summary>Plan: 4 to add, 2 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["StorageAccounts"] will be updated in-place
  ~ resource "azurerm_security_center_subscription_pricing" "main" {
        id            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/providers/Microsoft.Security/pricings/StorageAccounts"
      - subplan       = "PerTransaction" -> null
        # (2 unchanged attributes hidden)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["VirtualMachines"] will be updated in-place
  ~ resource "azurerm_security_center_subscription_pricing" "main" {
        id            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/providers/Microsoft.Security/pricings/VirtualMachines"
      - subplan       = "P2" -> null
        # (2 unchanged attributes hidden)
    }

  # module.shared_services.module.mod_shared_keyvault.data.azurerm_private_endpoint_connection.pip[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_private_endpoint_connection" "pip" {
      + id                         = (known after apply)
      + location                   = (known after apply)
      + name                       = "ampe-eus-prod-keys-prod-private-endpoint"
      + network_interface          = (known after apply)
      + private_service_connection = (known after apply)
      + resource_group_name        = "ampe-eus-svcs-core-prod-rg"
    }

  # module.shared_services.module.mod_shared_keyvault.azurerm_key_vault.keyvault[0] will be created
  + resource "azurerm_key_vault" "keyvault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = false
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "eastus"
      + name                            = "ampe-eus-prod-keys-prod"
      + public_network_access_enabled   = false
      + purge_protection_enabled        = false
      + resource_group_name             = "ampe-eus-svcs-core-prod-rg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 7
      + tags                            = {
          + "deployedBy"  = "AzureNoOpsTF"
          + "environment" = "public"
          + "workload"    = "prod-keys"
        }
      + tenant_id                       = "************************************"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.shared_services.module.mod_shared_keyvault.azurerm_key_vault_access_policy.admin_policy["b5c0c042-8317-4222-a16e-55377b7ec32f"] will be created
  + resource "azurerm_key_vault_access_policy" "admin_policy" {
      + certificate_permissions = [
          + "Backup",
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "ManageContacts",
          + "ManageIssuers",
          + "Purge",
          + "Recover",
          + "Restore",
          + "SetIssuers",
          + "Update",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Backup",
          + "Create",
          + "Decrypt",
          + "Delete",
          + "Encrypt",
          + "Get",
          + "Import",
          + "List",
          + "Purge",
          + "Recover",
          + "Restore",
          + "Sign",
          + "UnwrapKey",
          + "Update",
          + "Verify",
          + "WrapKey",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "************************************"
      + secret_permissions      = [
          + "Backup",
          + "Delete",
          + "Get",
          + "List",
          + "Purge",
          + "Recover",
          + "Restore",
          + "Set",
        ]
      + tenant_id               = "************************************"
    }

  # module.shared_services.module.mod_shared_keyvault.azurerm_private_dns_a_record.a_rec[0] will be created
  + resource "azurerm_private_dns_a_record" "a_rec" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ampe-eus-prod-keys-prod"
      + records             = (known after apply)
      + resource_group_name = "ampe-eus-svcs-core-prod-rg"
      + ttl                 = 300
      + zone_name           = "privatelink.vaultcore.azure.net"
    }

  # module.shared_services.module.mod_shared_keyvault.azurerm_private_endpoint.pep[0] will be created
  + resource "azurerm_private_endpoint" "pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "ampe-eus-prod-keys-prod-private-endpoint"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ampe-eus-svcs-core-prod-rg"
      + subnet_id                = "***********************************************************************************************************************************************************************************************************"
      + tags                     = {
          + "Name"       = "ampe-eus-prod-keys-prod-private-endpoint"
          + "deployedBy" = "AzureNoOpsTF"
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "keyvault-privatelink"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

Plan: 4 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create MPE Management terraform plan #41](https://github.com/AFMPE/mpe_management/actions/runs/4810957588)